---
kind: method
id: M:Autodesk.Revit.DB.FailuresAccessor.IsFailureResolutionPermitted
source: html/4c6bd02b-cb12-a14d-0861-ce468c229d93.htm
---
# Autodesk.Revit.DB.FailuresAccessor.IsFailureResolutionPermitted Method

Checks if resolution of failures is permitted.

## Syntax (C#)
```csharp
public bool IsFailureResolutionPermitted()
```

## Returns
True if resolutions of failures is permitted.